АлогистикТест2/src/Documents/алк_УстановкаЦенПоЗаказу/алк_УстановкаЦенПоЗаказу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаЦенПоЗаказу</name>
  <basedOn>Document.алк_ЗаказПокупателя</basedOn>
  <registerRecords>InformationRegister.алк_ЦеныПродукции</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапасыМассив</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыАссортимент</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗаказПокупателя/алк_ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗаказПокупателя</name>
  <registerRecords>InformationRegister.алк_АссортиментныеГруппыПредставление</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗаказыПокупателей</registerRecords>
  <registerRecords>InformationRegister.алк_ИД_ГруппХарактеристик</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗаказыПокупателейПоОбъемнымГруппам</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОтгрузкиПоЗаказам</registerRecords>
  <registerRecords>InformationRegister.алк_ОбъемныеГруппыПредставление</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НоименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеАссортиментМассивом</name>
    <comment>УДАЛИТЬ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МассивыНоменклатуры</name>
    <attributes>
      <name>Толщина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокШирина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыАссортимент</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемныеГруппы</name>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отпад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАддендум</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрТолщина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрШирина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрДлина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрСорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвтоПредставление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрКатегорияПЭО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>стрНомераКатегорияПЭО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_УстановкаЦенПоЗаказу/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			
		КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		
		Если ДанныеЗаполнения.Свойство("Направление") Тогда
			Направление = ДанныеЗаполнения.Направление;	
		КонецЕсли; 
		
	КонецПроцедуры
	
	
	// Обработчик заполнения документа на основании Заказа покупателя.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоЗаказПокупателя(ДанныеЗаполнения, Операция = "") Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Направление = ДанныеЗаполнения.Направление;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Номенклатура,
		|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ЕдиницаИзмерения,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ПредставлениеСтроки КАК ПредставлениеСтроки,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы КАК КлючСвязи,
		|	алк_ЗаказПокупателяОбъемныеГруппы.ПредставлениеАддендум КАК ПредставлениеАддендум,
		|	алк_ЗаказПокупателяОбъемныеГруппы.стрСорт КАК стрСорт
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ЗаказПокупателя.ОбъемныеГруппы КАК алк_ЗаказПокупателяОбъемныеГруппы
		|		ПО алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы = алк_ЗаказПокупателяОбъемныеГруппы.ИдентификаторГруппы
		|ГДЕ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Ссылка
		|	И алк_ЗаказПокупателяОбъемныеГруппы.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(КлючСвязи),
		|	МАКСИМУМ(стрСорт)
		|ПО
		|	ПредставлениеАддендум";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
		
		ВыборкаКлючСвязи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКлючСвязи.Следующий() Цикл
			
			НоваяСтрокаМассив = ЗапасыМассив.Добавить();
			НоваяСтрокаМассив.ПредставлениеСтроки = ?(ЗначениеЗаполнено(ВыборкаКлючСвязи.стрСорт), ВыборкаКлючСвязи.стрСорт + " - ", "") + ВыборкаКлючСвязи.ПредставлениеАддендум;
			НоваяСтрокаМассив.КлючСвязи           = ВыборкаКлючСвязи.КлючСвязи;
			
			мВыборкаДетальныеЗаписи = ВыборкаКлючСвязи.Выбрать();
			
			Пока мВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НоваяСтрокаАссортимент = ЗапасыАссортимент.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаАссортимент, мВыборкаДетальныеЗаписи);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецПроцедуры
	
	// Обработчик заполнения на основании данных заполнения.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура.
	//
	Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			
			ОнЖе = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьЗапасыПоТЧДокументыОснования();
		
	КонецПроцедуры
	
	
	Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
		
		ЗапасыАссортимент.Очистить();
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ЗаказПокупателя") Тогда
			
			ЗаполнитьПоЗаказПокупателя(ДокументОснование);
			
		КонецЕсли
		
		
	КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	
	#КонецОбласти
	
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения.
	//
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ЗаказПокупателя")] = "ЗаполнитьПоЗаказПокупателя";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
			
		КонецЕсли; 
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа.
		Документы.алк_УстановкаЦенПоЗаказу.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей.
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета.
		
		// Отражения в регистрах сведений
		РфпСервер.ОтразитьЦеныПродукции(ДополнительныеСвойства, Движения, Отказ);

		// СерийныеНомера
		//УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли


Процедура Конец()		
КонецПроцедуры
